-- phpMyAdmin SQL Dump
-- version 3.2.3
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Feb 09, 2015 at 12:49 AM
-- Server version: 5.1.40
-- PHP Version: 5.3.1

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

--
-- Database: `stormBase`
--

-- --------------------------------------------------------

--
-- Table structure for table `stm_boards`
--

CREATE TABLE IF NOT EXISTS `stm_boards` (
  `fid` int(11) NOT NULL AUTO_INCREMENT,
  `fboardType` varchar(45) CHARACTER SET ucs2 NOT NULL,
  `fboardName` varchar(45) NOT NULL,
  PRIMARY KEY (`fid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='Таблица описания плат DSLAM' AUTO_INCREMENT=5 ;

--
-- Dumping data for table `stm_boards`
--

INSERT INTO `stm_boards` (`fid`, `fboardType`, `fboardName`) VALUES
(1, '1753 (64)', 'IskraTel 1753'),
(2, 'ECI-8 (1)', 'ECI-8 (плата № 1)'),
(3, 'ECI-8 (2)', 'ECI-8 (плата № 2)'),
(4, 'ECI-8 (3)', 'ECI-8 (плата № 3)');

-- --------------------------------------------------------

--
-- Table structure for table `stm_tasks`
--

CREATE TABLE IF NOT EXISTS `stm_tasks` (
  `fid` int(11) NOT NULL AUTO_INCREMENT,
  `fphoneNumber` varchar(5) NOT NULL,
  `fboardId` mediumint(9) NOT NULL,
  `fport` tinyint(4) NOT NULL,
  `fdamageReason` text NOT NULL,
  `frepairNote` text,
  `fstartDateTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `fendDateTime` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `fdays` smallint(6) DEFAULT NULL,
  `fhours` smallint(6) DEFAULT NULL,
  `fminutes` smallint(6) DEFAULT NULL,
  PRIMARY KEY (`fid`),
  KEY `fphoneNumber` (`fphoneNumber`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='Таблица нарядов на обработку обращений клиентов' AUTO_INCREMENT=24 ;

--
-- Dumping data for table `stm_tasks`
--

INSERT INTO `stm_tasks` (`fid`, `fphoneNumber`, `fboardId`, `fport`, `fdamageReason`, `frepairNote`, `fstartDateTime`, `fendDateTime`, `fdays`, `fhours`, `fminutes`) VALUES
(1, '61717', 4, 17, 'Не работает интернет и все!', 'Вышел из строя модем', '2014-11-17 14:42:00', '2014-11-17 15:06:00', 0, 0, 24),
(2, '61212', 1, 12, 'Не работает интернет.', 'Проведена проверка линии', '2014-11-17 14:42:00', '2014-11-17 15:07:00', 0, 0, 25),
(3, '61346', 1, 46, 'Не работает интернет и все!', 'Проведена проверка линии', '2014-11-17 14:42:00', '2014-11-18 12:23:00', 0, 21, 41),
(4, '62141', 4, 21, 'Не горить індикатор "DSL".', 'Пошкодження лінії абонента. Лінію відновлено.', '2014-11-17 14:42:00', '2014-11-17 15:20:00', 0, 0, 38),
(5, '61717', 4, 17, 'Не работает интернет и все!', '', '2014-11-17 00:00:00', '0000-00-00 00:00:00', 0, 0, 0),
(6, '62446', 1, 7, 'Не горит индикатор "Интернет"', '', '2014-11-17 15:45:00', '0000-00-00 00:00:00', 0, 0, 0),
(7, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(8, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(9, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(10, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(11, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(12, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(13, '61556', 1, 3, 'Не включается модем', '', '2014-11-17 15:45:00', '0000-00-00 00:00:00', -16392, 11, 15),
(14, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(15, '61717', 4, 17, 'Не работает интернет и все!', '', '2014-11-18 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(16, '61719', 3, 29, 'Не работает интернет и все!', '', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(17, '62030', 1, 19, 'Что-то не работает!', '', '2014-11-17 16:00:00', '0000-00-00 00:00:00', 0, 0, 0),
(18, '61717', 4, 17, 'Не работает интернет, не горит индикатор "DSL".', 'Заміна вугільних контактів.', '2014-11-17 14:42:00', '2014-11-18 16:43:00', 1, 2, 1),
(19, '61553', 1, 15, 'Нет синхронизации.', '', '2014-11-18 16:25:00', '0000-00-00 00:00:00', 0, 0, 0),
(20, '63232', 3, 32, 'Не работает интернет и все!', '', '2014-11-18 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(22, '61532', 3, 37, 'Интернет работает с перебоями', NULL, '2014-11-20 11:30:00', '0000-00-00 00:00:00', 0, 0, 0),
(21, '61818', 1, 18, 'WTF?!!', NULL, '2015-02-08 23:47:34', '0000-00-00 00:00:00', 0, 0, 0),
(23, '61845', 4, 14, 'Нет синхронизации', NULL, '2014-12-07 13:56:00', '0000-00-00 00:00:00', NULL, NULL, NULL);
