-- phpMyAdmin SQL Dump
-- version 3.3.7deb7
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Ноя 20 2014 г., 17:00
-- Версия сервера: 5.1.73
-- Версия PHP: 5.3.3-7+squeeze19

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `stormBase`
--

-- --------------------------------------------------------

--
-- Структура таблицы `stm_boards`
--

CREATE TABLE IF NOT EXISTS `stm_boards` (
  `fid` int(11) NOT NULL AUTO_INCREMENT,
  `fboardType` varchar(45) CHARACTER SET ucs2 NOT NULL,
  `fboardName` varchar(45) NOT NULL,
  PRIMARY KEY (`fid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='Таблица описания плат DSLAM' AUTO_INCREMENT=5 ;

--
-- Дамп данных таблицы `stm_boards`
--

INSERT INTO `stm_boards` (`fid`, `fboardType`, `fboardName`) VALUES
(1, '1753 (64)', 'IskraTel 1753'),
(2, 'ECI-8 (1)', 'ECI-8 (плата № 1)'),
(3, 'ECI-8 (2)', 'ECI-8 (плата № 2)'),
(4, 'ECI-8 (3)', 'ECI-8 (плата № 3)');

-- --------------------------------------------------------

--
-- Структура таблицы `stm_tasks`
--

CREATE TABLE IF NOT EXISTS `stm_tasks` (
  `fid` int(11) NOT NULL AUTO_INCREMENT,
  `fphoneNumber` varchar(5) NOT NULL,
  `fboardId` mediumint(9) NOT NULL,
  `fport` tinyint(4) NOT NULL,
  `fdamageReason` text NOT NULL,
  `frepairNote` text,
  `fstartDateTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `fendDateTime` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `fdays` smallint(6) DEFAULT NULL,
  `fhours` smallint(6) DEFAULT NULL,
  `fminutes` smallint(6) DEFAULT NULL,
  PRIMARY KEY (`fid`),
  KEY `fphoneNumber` (`fphoneNumber`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='Таблица нарядов на обработку обращений клиентов' AUTO_INCREMENT=23 ;

--
-- Дамп данных таблицы `stm_tasks`
--

INSERT INTO `stm_tasks` (`fid`, `fphoneNumber`, `fboardId`, `fport`, `fdamageReason`, `frepairNote`, `fstartDateTime`, `fendDateTime`, `fdays`, `fhours`, `fminutes`) VALUES
(1, '61717', 4, 17, 'Не работает интернет и все!', 'Шо за пиздец?!', '2014-11-17 14:42:00', '2014-11-17 15:06:00', 0, 0, 0),
(2, '61212', 1, 12, 'Не работает интернет.', 'Та просто жопа!', '2014-11-17 14:42:00', '2014-11-17 15:07:00', 0, 0, 0),
(3, '61346', 1, 46, 'Не работает интернет и все!', 'Шо це за жопа?', '2014-11-17 14:42:00', '2014-11-18 12:23:00', 0, 0, 0),
(4, '62141', 2, 41, 'Не горить індикатор "DSL".', 'Пошкодження лінії абонента.', '2014-11-17 14:42:00', '2014-11-17 15:20:00', 0, 0, 0),
(5, '61717', 4, 17, 'Не работает интернет и все!', '', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(6, '62446', 1, 7, 'Не горит индикатор "Интернет"', '', '2014-11-17 15:45:00', '0000-00-00 00:00:00', 0, 0, 0),
(7, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(8, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(9, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(10, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(11, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(12, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(13, '61556', 1, 3, 'Заебали меня все шо пиздец!', '', '2014-11-17 15:45:00', '0000-00-00 00:00:00', 0, 0, 0),
(14, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(15, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(16, '61719', 3, 29, 'Не работает интернет и все!', '', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(17, '62030', 1, 19, 'Что-то не работает!', '', '2014-11-17 16:00:00', '0000-00-00 00:00:00', 0, 0, 0),
(18, '61717', 4, 17, 'Не работает интернет и все!', '445', '2014-11-17 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(19, '61553', 1, 15, 'Нет синхронизации.', '', '2014-11-18 16:25:00', '0000-00-00 00:00:00', 0, 0, 0),
(20, '63232', 3, 32, 'Не работает интернет и все!', '', '2014-11-18 14:42:00', '0000-00-00 00:00:00', 0, 0, 0),
(22, '61532', 3, 37, 'Интернет работает с перебоями', NULL, '2014-11-20 11:30:00', '0000-00-00 00:00:00', 0, 0, 0),
(21, '61818', 1, 18, 'Fucking ass!', NULL, '2014-11-17 15:01:00', '0000-00-00 00:00:00', 0, 0, 0);
